// Створюємо змінну і присвоюємо їй значення 'number' + 3 + 3
var result1 = 'number' + 3 + 3;
console.log(result1); // Очікуваний результат: 'number33'

// Створюємо змінну і присвоюємо їй значення null + 3
var result2 = null + 3;
console.log(result2); // Очікуваний результат: 3 (оскільки null конвертується в 0)


// Створюємо змінну і присвоюємо їй значення 5 && "qwerty"
var result3 = 5 && "qwerty";
console.log(result3); // Очікуваний результат: 'qwerty' (оскільки "qwerty" є true)


// Створюємо змінну і присвоюємо їй значення +'40' + +'2' + "hilel"
var result4 = +'40' + +'2' + "hillel";
console.log(result4); // Очікуваний результат: '42hilel' (оскільки +'40' дорівнює 40, +'2' дорівнює 2)


// Створюємо змінну і присвоюємо їй значення '10' - 5 === 6
var result5 = '10' - 5 === 6;
console.log(result5); // Очікуваний результат: false (оскільки '10' конвертується в 10)

// Створюємо змінну і присвоюємо їй значення true + false
var result6 = true + false;
console.log(result6); // Очікуваний результат: 1 (оскільки true конвертується в 1)

// Створюємо змінну і присвоюємо їй значення '4px' - 3
var result7 = '4px' - 3;
console.log(result7); // Очікуваний результат: NaN (оскільки '4px' неможливо відняти від числа)

// Створюємо змінну і присвоюємо їй значення '4' - 3
var result8 = '4' - 3;
console.log(result8); // Очікуваний результат: 1 (оскільки '4' конвертується в 4)

// Створюємо змінну і присвоюємо їй значення '6' + 3 ** 0
var result9 = '6' + 3 ** 0;
console.log(result9); // Очікуваний результат: '61' (оскільки 3 ** 0 дорівнює 1)


// Створюємо змінну і присвоюємо їй значення 12 / '6'
var result10 = 12 / '6';
console.log(result10); // Очікуваний результат: 2 (оскільки '6' конвертується в 6)

// Створюємо змінну і присвоюємо їй значення '10' + (5 === 6)
var result11 = '10' + (5 === 6);
console.log(result11); // Очікуваний результат: '10false' (оскільки 5 === 6 дорівнює false)

// Створюємо змінну і присвоюємо їй значення null == ''
var result12 = null == '';
console.log(result12); // Очікуваний результат: false (оскільки null відрізняється від порожнього рядка)

// Створюємо змінну і присвоюємо їй значення 3 ** (9 / 3)
var result13 = 3 ** (9 / 3);
console.log(result13); // Очікуваний результат: 27 (оскільки 9 / 3 дорівнює 3, а піднесення 3 до степеня 3 дорівнює 27)

// Створюємо змінну і присвоюємо їй значення !!'false' == !!'true'
var result14 = !!'false' == !!'true';
console.log(result14); // Очікуваний результат: true (оскільки !!'false' дорівнює false, !!'true' дорівнює true)


// Створюємо змінну і присвоюємо їй значення 0 || '0' && 1
var result15 = 0 || '0' && 1;
console.log(result15); // Очікуваний результат: '1' 